$ определить предикат mrg(L1, L2, R) который для двух отсортированных списков L1 и L2 
% определяет список R, составленный из этих элементов
mrg(L1,[],R) :- R=L1.
mrg([],L2,R) :- R=L2.
mrg([L1_H|L1_T],[L2_H|L2_T],R) :- L1_H < L2_H, append([L1_H],R2,R), mrg(L1_T,[L2_H|L2_T],R2).
mrg([L1_H|L1_T],[L2_H|L2_T],R) :- L1_H >= L2_H, append([L2_H],R2,R), mrg([L1_H|L1_T],L2_T,R2).

% ?- mrg([1,2,3,4,5], [6,7], M).
% M = [1,2,3,4,5,6,7] .

% ?- mrg([0,2,6,25], [1,3,6,9,33], M).
% M = [0, 1, 2, 3, 6, 6, 9, 25, 33] .
