% определить предикат mrg(L1, L2, R) который для двух отсортированных списков L1 и L2 
% определяет список R, составленный из этих элементов

mrg([L1|L1_tail], [L2|L2_tail], [L1|Result]):-
    L1 =< L2,
    mrg(L1_tail, [L2|L2_tail], Result).

mrg([L1|L1_tail], [L2|L2_tail], [L2|Result]):-
    L1 > L2,
    mrg([L1|L1_tail], L2_tail, Result).

mrg(L1, [], L1).

mrg([], L2, L2).

mrg([], [], []).

% Проверка

% ?- mrg([2, 4, 6, 8], [3, 5, 7, 9], X).
% X = [2, 3, 4, 5, 6, 7, 8, 9] ;

% ?- mrg([1, 100, 500], [23, 89, 115], [1, 23, 89, 100, 115, 500]).
% true ;